Revit 2016 API
UnitSymbolType Enumeration
 The unit symbol displayed in the formatted string representation of a number to indicate the units of the value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum UnitSymbolType
Visual Basic
Public Enumeration UnitSymbolType
Visual C++
public enum class UnitSymbolType
Members
Member name | Description
UST_NONE
UST_M
UST_CM
UST_MM
UST_LF
UST_FOOT_SINGLE_QUOTE
UST_FT
UST_INCH_DOUBLE_QUOTE
UST_IN
UST_ACRES
UST_HECTARES
UST_CY
UST_SF
UST_FT_SUP_2
UST_FT_CARET_2
UST_M_SUP_2
UST_M_CARET_2
UST_CF
UST_FT_SUP_3
UST_FT_CARET_3
UST_M_SUP_3
UST_M_CARET_3
UST_DEGREE_SYMBOL
UST_PERCENT_SIGN
UST_IN_SUP_2
UST_IN_CARET_2
UST_CM_SUP_2
UST_CM_CARET_2
UST_MM_SUP_2
UST_MM_CARET_2
UST_IN_SUP_3
UST_IN_CARET_3
UST_CM_SUP_3
UST_CM_CARET_3
UST_MM_SUP_3
UST_MM_CARET_3
UST_L
UST_GAL
UST_KG_PER_CU_M
UST_LB_MASS_PER_CU_FT
UST_LBM_PER_CU_FT
UST_LB_MASS_PER_CU_IN
UST_LBM_PER_CU_IN
UST_BTU
UST_CAL
UST_KCAL
UST_JOULE
UST_KWH
UST_THERM
UST_IN_WG_PER_100FT
UST_PASCAL_PER_M
UST_WATT
UST_KILOWATT
UST_BTU_PER_S
UST_BTU_PER_H
UST_CAL_PER_S
UST_KCAL_PER_S
UST_WATT_PER_SQ_FT
UST_WATT_PER_SQ_M
UST_IN_WG
UST_PASCAL
UST_KILOPASCAL
UST_MEGAPASCAL
UST_PSI
UST_LB_FORCE_PER_SQ_IN
UST_PSIG
UST_PSIA
UST_LBF_PER_SQ_IN
UST_IN_HG
UST_MM_HG
UST_ATM
UST_BAR
UST_DEGREE_F
UST_DEGREE_C
UST_KELVIN
UST_DEGREE_R
UST_FT_PER_MIN
UST_FPM
UST_M_PER_S
UST_CM_PER_MIN
UST_CU_FT_PER_MIN
UST_CFM
UST_L_PER_S
UST_LPS
UST_CU_M_PER_S
UST_CMS
UST_CU_M_PER_H
UST_CMH
UST_GAL_PER_MIN
UST_GPM
UST_USGPM
UST_GAL_PER_H
UST_GPH
UST_USGPH
UST_AMPERE
UST_KILOAMPERE
UST_MILLIAMPERE
UST_VOLT
UST_KILOVOLT
UST_MILLIVOLT
UST_HZ
UST_CPS
UST_LX
UST_FC
UST_FTC
UST_FL
UST_FL_LOWERCASE
UST_FTL
UST_CD_PER_SQ_M
UST_CD
UST_LM
UST_VOLTAMPERE
UST_KILOVOLTAMPERE
UST_HP
UST_N
UST_DA_N
UST_K_N
UST_M_N
UST_KIP
UST_KGF
UST_TF
UST_LB_FORCE
UST_LBF
UST_N_PER_M
UST_DA_N_PER_M
UST_K_N_PER_M
UST_M_N_PER_M
UST_KIP_PER_FT
UST_KGF_PER_M
UST_TF_PER_M
UST_LB_FORCE_PER_FT
UST_LBF_PER_FT
UST_N_PER_M_SUP_2
UST_DA_N_PER_M_SUP_2
UST_K_N_PER_M_SUP_2
UST_M_N_PER_M_SUP_2
UST_KSF
UST_KIP_PER_SQ_FT
UST_KGF_PER_M_SUP_2
UST_TF_PER_M_SUP_2
UST_PSF
UST_LB_FORCE_PER_SQ_FT
UST_LBF_PER_SQ_FT
UST_N_DASH_M
UST_DA_N_DASH_M
UST_K_N_DASH_M
UST_M_N_DASH_M
UST_KIP_DASH_FT
UST_KGF_DASH_M
UST_TF_DASH_M
UST_LB_FORCE_DASH_FT
UST_LBF_DASH_FT
UST_M_PER_K_N
UST_FT_PER_KIP
UST_M_SUP_2_PER_K_N
UST_FT_SUP_2_PER_KIP
UST_M_SUP_3_PER_K_N
UST_FT_SUP_3_PER_KIP
UST_INV_K_N
UST_INV_KIP
UST_FTH2O_PER_100FT
UST_FT_OF_WATER_PER_100FT
UST_FEET_OF_WATER_PER_100FT
UST_FTH2O
UST_FT_OF_WATER
UST_FEET_OF_WATER
UST_PA_S
UST_LB_FORCE_PER_FT_S
UST_LBM_PER_FT_S
UST_CP
UST_FT_PER_S
UST_FPS
UST_KSI
UST_KIP_PER_SQ_IN
UST_KN_PER_M_SUP_3
UST_LB_FORCE_PER_CU_FT
UST_LBF_PER_CU_FT
UST_KIP_PER_IN_SUP_3
UST_INV_DEGREE_F
UST_INV_DEGREE_C
UST_N_DASH_M_PER_M
UST_DA_N_DASH_M_PER_M
UST_K_N_DASH_M_PER_M
UST_M_N_DASH_M_PER_M
UST_KIP_DASH_FT_PER_FT
UST_KGF_DASH_M_PER_M
UST_TF_DASH_M_PER_M
UST_LB_FORCE_DASH_FT_PER_FT
UST_LBF_DASH_FT_PER_FT
UST_LB_FORCE_PER_FT_H
UST_LBM_PER_FT_H
UST_KIPS_PER_IN
UST_KIPS_PER_CU_FT
UST_KIP_FT_PER_DEGREE
UST_K_N_M_PER_DEGREE
UST_KIP_FT_PER_DEGREE_PER_FT
UST_K_N_M_PER_DEGREE_PER_M
UST_WATT_PER_SQ_M_K
UST_BTU_PER_H_SQ_FT_DEGREE_F
UST_CFM_PER_SQ_FT
UST_CFM_PER_SF
UST_LPS_PER_SQ_M
UST_L_PER_S_SQ_M
UST_COLON_10
UST_COLON_12
UST_SLOPE_DEGREE_SYMBOL
UST_WATT_PER_CU_FT
UST_WATT_PER_CU_M
UST_BTU_PER_H_SQ_FT
UST_BTU_PER_H_CU_FT
UST_TON
UST_CFM_PER_CU_FT
UST_CFM_PER_CF
UST_L_PER_S_CU_M
UST_CFM_PER_TON
UST_L_PER_S_KW
UST_SQ_FT_PER_TON
UST_SF_PER_TON
UST_SQ_M_PER_KW
UST_DOLLAR
UST_EURO_SUFFIX
UST_EURO_PREFIX
UST_POUND
UST_YEN
UST_CHINESE_HONG_KONG_SAR
UST_WON
UST_SHEQEL
UST_DONG
UST_BAHT
UST_KRONER
UST_LM_PER_W
UST_SF_PER_MBH
UST_SF_PER_KBTU_PER_H
UST_SQ_FT_PER_MBH
UST_SQ_FT_PER_KBTU_PER_H
UST_K_N_PER_CM_SUP_2
UST_N_PER_MM_SUP_2
UST_K_N_PER_MM_SUP_2
UST_ONE_COLON
UST_H_SQ_FT_DEGREE_F_PER_BTU
UST_SQ_M_K_PER_WATT
UST_BTU_PER_F
UST_J_PER_KELVIN
UST_KJ_PER_KELVIN
UST_KGM
UST_TM
UST_LB_MASS
UST_LBM
UST_M_PER_SQ_S
UST_KM_PER_SQ_S
UST_IN_PER_SQ_S
UST_FT_PER_SQ_S
UST_MI_PER_SQ_S
UST_FT_SUP_4
UST_IN_SUP_4
UST_MM_SUP_4
UST_CM_SUP_4
UST_M_SUP_4
UST_FT_SUP_6
UST_IN_SUP_6
UST_MM_SUP_6
UST_CM_SUP_6
UST_M_SUP_6
UST_SQ_FT_PER_FT
UST_SQ_IN_PER_FT
UST_SQ_MM_PER_M
UST_SQ_CM_PER_M
UST_SQ_M_PER_M
UST_KGM_PER_M
UST_LB_MASS_PER_FT
UST_LBM_PER_FT
UST_RAD
UST_GRAD
UST_RAD_PER_S
UST_MS
UST_S
UST_MIN
UST_H
UST_KM_PER_H
UST_MI_PER_H
UST_KJ
UST_KGM_PER_SQ_M
UST_LBM_PER_SQ_FT
UST_WATTS_PER_METER_KELVIN
UST_J_PER_G_CELSIUS
UST_J_PER_G
UST_NG_PER_PA_S_SQ_M
UST_OHM_M
UST_BTU_PER_H_FT_DEGREE_F
UST_BTU_PER_LB_DEGREE_F
UST_BTU_PER_LB
UST_GR_PER_H_SQ_FT_IN_HG
UST_PER_MILLE_SIGN
UST_DM
UST_J_PER_KG_CELSIUS
UST_UM_PER_M_C
UST_UIN_PER_IN_F
UST_USTONNES_MASS_TONS
UST_USTONNES_MASS_T
UST_USTONNES_MASS_ST
UST_USTONNES_FORCE_TONSF
UST_USTONNES_FORCE_STF
UST_USTONNES_FORCE_AS_MASS_TONS
UST_USTONNES_FORCE_AS_MASS_T
UST_USTONNES_FORCE_AS_MASS_ST
UST_L_PER_M
UST_LPM
Remarks
 Most unit symbols appear as suffixes after the formatted number, for example "mm" for millimeters. Some currency symbols appear as prefixes, for example "$" for dollars.
See Also
Autodesk.Revit.DB Namespace